[Words]
owl=부엉이
where=어디에
animal=동물
tree=나무
grey=흰색(의)
brown=밤색(의)
still=고요한
butterfly=나비
yellow=노란색(의)
orange=감색(의)
beautiful=아름다운
forest=숲
jungle=열대림
tiger=범
black=검은색(의)
fast=빨리
sleep=자다
snake=뱀
green=풀색(의)
careful=조심하는
crocodile=악어
swim=헤염치다
trunk=코끼리코
its=그것의
snow=(내리는)눈
ice=얼음
polar=극지방의
polar bear=북극곰

[Compound Words]
sit in a tree=나무에 앉아있다
very still=매우 고요한
see them=그것들을 보다
run very fast=매우 빨리 뛰다
by the river=강가에(서)
Be careful!=주의해라!
swim in the river=강에서 헤염치다
walk in the trees=나무들속에서 걷다
in the forest=숲속에서
big ears=큰 귀
in the snow=눈속에(서)
some animals=일부 동물들

[Noun]
owl
animal
tree
butterfly
forest
jungle
tiger
snake
crocodile
trunk
snow
ice
polar bear

[Verb]
sleep
swim
live
sit
fly
find
see
run

[Adjective]
grey
brown
still
yellow
orange
beautiful
black
green
careful
polar

[Adverb]
fast
too

[Other]
where
what
can
